loadtest-artillery/get-questions-list.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 50
      name: 'Warm up the app'
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: 'Ramp up load'
    - duration: 30
      arrivalRate: 100
      name: 'Sustain 100RPS load'
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      name: 'Ramp up to max load'
    - duration: 30
      arrivalRate: 1000
      name: 'Sustain max load 1000RPS'
scenarios:
  - name: 'Get questions list'
    flow:
      - get:
          url: '/qa/{{$randomNumber(1,999999)}}'