loadtest-artillery/get-questions-list.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: 'Warm up the app'
    - duration: 60
      arrivalRate: 50
      name: 'Sustained max load'
scenarios:
  - name: 'Get questions list'
    flow:
      - get:
          url: '/qa/{{$randomNumber(1,999999)}}'